package com.yunjin.sms.wocloud.core;


import lombok.AllArgsConstructor;
import lombok.Getter;

/**
 * <p>
 * HTTP错误代码描述
 * </p>
 *
 * @author Carlos
 * @date 2024/1/15 14:56
 */
@Getter
@AllArgsConstructor
public enum WoCloudErrorCode {
    CODE_0(0, "成功"),
    CODE_9(9, "失败"),
    CODE_10(10, "处理超时"),
    CODE_429(429, "请求过多"),
    CODE_999(999, "余额不足"),
    CODE_1000(1000, "账号/密码错误"),
    CODE_1001(1001, "手机号码错误"),
    CODE_1002(1002, "内容格式错误"),
    CODE_1003(1003, "模板id错误"),
    CODE_1004(1004, "定时时间格式错误"),
    CODE_1005(1005, "自定义id不可超过36位"),
    CODE_1006(1006, "号码数已达上限"),
    CODE_1007(1007, "定时必须大于10分钟"),
    CODE_1008(1008, "未支持的套餐"),
    CODE_1009(1009, "账户未启用"),
    CODE_1010(1010, "IP校验未通过"),
    CODE_1011(1011, "未在服务时间范围"),
    CODE_1012(1012, "内容字数已达上限"),
    CODE_5000(5000, "缺省参数未配置"),
    CODE_5001(5001, "其他错误"),
    CODE_5002(5002, "调用频率过快，接口调用时间间隔"),
    CODE_5003(5003, "调用频次过快，接口每秒调用次数上限"),
    CODE_5004(5004, "时间戳已过期"),
    CODE_10000(10000, "扩展号错误"),
    CODE_10001(10001, "短信签名错误"),
    CODE_10002(10002, "短信模板不匹配"),
    CODE_10003(10003, "短信密钥账号不存在"),
    CODE_10004(10004, "未激活短信业务"),
    CODE_10005(10005, "内容存在关键字"),
    CODE_10006(10006, "Excel短信格式错误，过滤后无数据"),
    CODE_10007(10007, "短信内容中存在签名"),
    CODE_10008(10008, "未开通短信模板"),
    CODE_10009(10009, "连接方式错误"),
    CODE_10010(10010, "当前操作已被锁定"),
    CODE_10011(10011, "模板数量已达上限"),
    CODE_10012(10012, "存在相同的模板"),
    CODE_10013(10013, "存在相同的签名"),
    CODE_10014(10014, "签名数量已达上限"),
    CODE_10015(10015, "短信密钥已被锁定"),
    CODE_15000(15000, "语音密钥账号不存在"),
    CODE_15001(15001, "未激活语音业务"),
    CODE_15002(15002, "语音模板不匹配"),
    CODE_15003(15003, "语音模板配置错误"),
    CODE_15004(15004, "语音Excel信息格式错误"),
    CODE_15005(15005, "语音模板变量格式错误"),
    ;


    private final Integer code;
    private final String message;

}
